
## Terraform plan for environment: `int`

**Commit:** 3eaa641a20c93b93a1db3ce359d32db4b9eafe0f


**API version:** c780dc1b32
**CLI version:** 0da99b784c
**Selfserve version:** 2bba0b3868
**Internal version:** 835df3877a

### Plan summary

`12 to add, 82 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudwatch_log_group.this["import-anondb"]
module.service.aws_cloudwatch_log_group.this["ni-compliance"]
module.service.aws_cloudwatch_log_group.this["populate-anondb"]
module.service.aws_cloudwatch_log_group.this["sas-mi-extract"]
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.cloudwatch_log-metric-filter["import-anondb"].aws_cloudwatch_log_metric_filter.this[0]
module.service.module.cloudwatch_log-metric-filter["ni-compliance"].aws_cloudwatch_log_metric_filter.this[0]
module.service.module.cloudwatch_log-metric-filter["populate-anondb"].aws_cloudwatch_log_metric_filter.this[0]
module.service.module.cloudwatch_log-metric-filter["sas-mi-extract"].aws_cloudwatch_log_metric_filter.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
```
**📖 Reads**

```tf
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.aws_cloudwatch_dashboard.this
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-clean-up-variations-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-close-expired-windows-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-cns-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-company-profile-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-create-psv-licence-surrender-task-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-digital-continuation-reminders-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-duplicate-vehicle-removal-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-duplicate-vehicle-warning-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-enqueue-ch-compare-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-expire-bus-registration-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-flag-urgent-tasks-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-inspection-request-email-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-interim-end-date-enforcement-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-international-goods-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-last-tm-letter-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-licence-status-rules-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-mark-expired-permits-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-company-profile-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-inbox-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-ntu-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-community-licences-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-disc-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-disc-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-ecmt-accept-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-general-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-irhp-allocate-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-permit-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-permit-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-psv-operator-list-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-remove-read-audit-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-resolve-payments-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-transxchange-consumer-0"]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "8614501910279416894" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_cli_image_tag"       = "c780dc1b32" -> "0da99b784c"
            # (4 unchanged elements hidden)
        }
    }

  # module.service.aws_cloudwatch_dashboard.this will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "this" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (1 unchanged element hidden)
                    {
                        height     = 6
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/events/vol-app-int-failures' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "Batch failure logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 18
                        x          = 12
                        y          = 6
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (45 unchanged elements hidden)
                                [
                                    "AWS/Logs",
                                    "IncomingLogEvents",
                                    "LogGroupName",
                                    "/aws/batch/vol-app-int-liquibase",
                                ],
                              + [
                                  + "AWS/Logs",
                                  + "IncomingLogEvents",
                                  + "LogGroupName",
                                  + "/aws/batch/vol-app-int-sas-mi-extract",
                                ],
                              + [
                                  + "AWS/Logs",
                                  + "IncomingLogEvents",
                                  + "LogGroupName",
                                  + "/aws/batch/vol-app-int-import-anondb",
                                ],
                              + [
                                  + "AWS/Logs",
                                  + "IncomingLogEvents",
                                  + "LogGroupName",
                                  + "/aws/batch/vol-app-int-populate-anondb",
                                ],
                              + [
                                  + "AWS/Logs",
                                  + "IncomingLogEvents",
                                  + "LogGroupName",
                                  + "/aws/batch/vol-app-int-ni-compliance",
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-ch-vs-olcs-diffs' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "ch-vs-olcs-diffs-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                    # (44 unchanged elements hidden)
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-liquibase' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "liquibase-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                  + {
                      + height     = 1
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-sas-mi-extract' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "sas-mi-extract-logs"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 6
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 1
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-import-anondb' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "import-anondb-logs"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 6
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 1
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-populate-anondb' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "populate-anondb-logs"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 6
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 1
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-ni-compliance' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "ni-compliance-logs"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 6
                      + x          = 0
                      + y          = 0
                    },
                ]
            }
        )
        id             = "batch-vol-app-int"
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this["import-anondb"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-import-anondb"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["ni-compliance"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-ni-compliance"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["populate-anondb"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-populate-anondb"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["sas-mi-extract"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-sas-mi-extract"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:290"
        name                       = "vol-app-int-cancel-unsubmitted-bilateral"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:290"
        name                       = "vol-app-int-ch-vs-olcs-diffs"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:290"
        name                       = "vol-app-int-clean-up-variations"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:291" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:291"
        name                       = "vol-app-int-close-expired-windows"
      ~ revision                   = 291 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:291" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:291"
        name                       = "vol-app-int-cns"
      ~ revision                   = 291 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:291" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:291"
        name                       = "vol-app-int-company-profile-dlq"
      ~ revision                   = 291 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:290"
        name                       = "vol-app-int-create-psv-licence-surrender-task"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:290"
        name                       = "vol-app-int-data-retention-delete"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:290"
        name                       = "vol-app-int-data-retention-populate"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:290"
        name                       = "vol-app-int-data-retention-postcheck"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:290"
        name                       = "vol-app-int-data-retention-precheck"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:290"
        name                       = "vol-app-int-database-maintenance"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:290"
        name                       = "vol-app-int-digital-continuation-reminders"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-removal:24" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-removal:24"
        name                       = "vol-app-int-duplicate-vehicle-removal"
      ~ revision                   = 24 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:290"
        name                       = "vol-app-int-duplicate-vehicle-warning"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:290"
        name                       = "vol-app-int-enqueue-ch-compare"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:290"
        name                       = "vol-app-int-expire-bus-registration"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:290"
        name                       = "vol-app-int-flag-urgent-tasks"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-import-anondb"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:290"
        name                       = "vol-app-int-import-users-from-csv"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:290"
        name                       = "vol-app-int-inspection-request-email"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:290"
        name                       = "vol-app-int-interim-end-date-enforcement"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:290"
        name                       = "vol-app-int-international-goods-export"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:291" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:291"
        name                       = "vol-app-int-last-tm-letter"
      ~ revision                   = 291 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:290"
        name                       = "vol-app-int-licence-status-rules"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:291" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:291"
        name                       = "vol-app-int-mark-expired-permits"
      ~ revision                   = 291 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-ni-compliance"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-populate-anondb"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:290"
        name                       = "vol-app-int-process-cl"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:291" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:291"
        name                       = "vol-app-int-process-company-profile"
      ~ revision                   = 291 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:290" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:290"
        name                       = "vol-app-int-process-inbox"
      ~ revision                   = 290 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:291" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "c780dc1b32" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "0da99b784c"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c780dc1b32" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:0da99b784c"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:291"
        na... (truncated, see full plan in the workflow run logs)
```

</details>